Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.NeedsSubSchemaGUID
Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
Returns:
True if SubSchemaGUID is required.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.NeedsUnits
Checks whether the field type requires explicit unit conversions.
Returns:
True if units are required.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.Ready
Checks whether the builder may be used.
Remarks:
All newly constructed FieldBuilders are usable until the call to the Finish method
of the constructing SchemaBuilder.
Returns:
True if the SchemaBuilder has not yet been finished.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.SetDocumentation(System.String)
Sets the documentation string for the Field.
Remarks:
While Entities may be hidden using access levels, Schemas and Fields are visible to
clients and other developers. In the interest of clarity and interoperability, you are
very strongly encouraged to provide good documentation with your Schemas.
Explain the intent of the data and how it is meant to be interpreted. It is not
useful to repeat information that can be observed directly (e.g. types and units).
Note that documentation, like all other contents of Schemas and Fields is immutable
once the add-in using the Schema is published.
documentation:
The documentation string.
Returns:
The FieldBuilder object may be used to add more details to the field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.SetSubSchemaGUID(System.Guid)
Sets the GUID of the Schema of the Entities that are intended to be stored in this field.
Remarks:
Fields of type Entity - subentities - need to specify their Schema. The framework
will prevent subentities with incorrect schemas from being stored in the entity.
Additionally, the access level of the subschema will be checked against the
currently executing add-in and access to restricted subentities will be prevented.
guid:
The GUID of the subschema.
Returns:
The FieldBuilder object may be used to add more details to the field.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
-or-
The field type does not utilize SubSchemas.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.SetUnitType(Autodesk.Revit.DB.UnitType)
Sets the type of units for the field.
Remarks:
All floating-point fields (float, double, XYZ, UV and containers of these values)
will be internally stored in the metric system. You must specify the unit type (length,
temperature, etc.) via this method for such fields. Conversely, all other field types may not have
units.  Do not call this method on those fields.
The dimension of the field (3 for XYZ, 2 for UV, arbitrary for array) extends the power
of the unit type by allowing you to represent vectors of values of specific units. Each
component will be converted independently. Using vectors to represent multiple
independent values will work efficiently, but make sure the documentation is adequate.
The Get and Set methods will need you to specify the units in which your program works,
as a DisplayUnitType. These units must be compatible with the UnitType. Revit will
convert the stored values from/to the units you specify.
Use UT_Custom and DUT_CUSTOM to explicitly disable conversions for a field.
units:
Units type value to be set
Returns:
The FieldBuilder object may be used to add more details to the field.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
-or-
The field type does not utilize unit conversions.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Field,Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder)
Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor(Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder)
Constructs a new copy of the input ESFieldBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder
This class is used to create Fields in the Extensible Storage framework.
Since:
2012